Parte Panda

Clase 26

In [49]:
import numpy as np
import pandas as pd

In [50]:
labels = ['a','b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [51]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

Coger informaci√≥n de una Serie

In [52]:
ser1 = pd.Series([1,2,3,4],['USA','Germany', 'Italy', 'Japan'])

In [53]:
ser2 = pd.Series([1,2,3,4],['USA','Germany', 'URSS', 'Japan'])

In [54]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
URSS       NaN
USA        2.0
dtype: float64

In [55]:
ser3 = pd.Series(data=labels)

In [56]:
ser3

0    a
1    b
2    c
dtype: object

Dataframes Clase 27

In [57]:
from numpy.random import randn

In [58]:
np.random.seed(101)

In [59]:
df = pd.DataFrame(randn(5,4),['A','B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [60]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [61]:
df[['W','Z']] # Se pasa una lista para acceder a las columnas de una tabla

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [62]:
df['new'] = df['W'] + df['Z']

In [63]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [64]:
df.drop('new', axis=1,inplace=True) 
#implace indica si quieres que se borre de la tabla general
#Tambi√©n se pueden borrar filas

In [65]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
#Select rows

In [67]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [68]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [69]:
df.loc['B', 'Y']

-0.8480769834036315

In [70]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [71]:
#Boolean values

In [72]:
booldf = df > 0

In [73]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [74]:
df[df['W']>0][['X','Y']]#Eliminas los datos que no lo cumple

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [75]:
df[(df['W']>0) | (df['Y']>1)]
#Or |
#And &

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [76]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [77]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )